codeigniter4-CodeIgniter4-202f41a/app/Controllers/Login.php

INSERT INTO `users` (`email`, `password`) VALUES ('tanvi@gmail.com', 'Tanvi@123')
---
    public function register()

    {
        $check = $this->validate([
            'name' => 'required',
            'lastname' => 'required',
            'email' => 'required',
            'phone' => 'required',
            'password' => 'required',
        ]);
        if ($check) {
            return view('register', ['validation' => $this->validator]);
        } else {
            $model = new UserModel();

            $data = [
                'name' => $this->request->getVar('name'),
                'lastname' => $this->request->getVar('lastname'),
                'email' => $this->request->getVar('email'),
                'phone' => $this->request->getVar('phone'),
                'password' => password_hash($this->request->getVar('pass'), PASSWORD_BCRYPT)

            ];

            $model->insert($data);