codeigniter4-CodeIgniter4-202f41a/app/Controllers/Login.php

    public function submit()
    {
        $validationRule = [
            "email" => "required",
            "password" => "required"
        ];
        $usrmodel = new Usermodel();
        $data['table'] = $usrmodel->findAll();
        $result = $usrmodel->where('email', $this->request->getvar('email'))->first();
---
SELECT *
FROM `users`
SELECT *
FROM `users`
WHERE `email` = 'diptishelke8514@gmail.com'
 LIMIT 1

    public function edit($id)
    {
        $usrmodel = new Usermodel();
        $data['row'] = $usrmodel->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1