codeigniter4-CodeIgniter4-202f41a/app/Controllers/Register.php

SELECT *
FROM `users`
---
    public function submit()
    {
        $data = [];

        $usrmodel = new Usermodel();
        $data['table'] = $usrmodel->findAll();