codeigniter4-CodeIgniter4-202f41a/app/Controllers/Register.php

    public function submit()
    {
        $data = [];
        $rules = [
            'email' => [
                'label' => 'Email',
                'rules' => 'required|valid_email',
                'errors' => [
                    'required' => '{field} field required',
                    'valid_email' => 'valid{field} required'
                ]

            ],
        ];
        $usermodel = new Usermodel();
        $result = $usermodel->where('email', $this->request->getvar('email'))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'diptishelke8514@gmail.com'
 LIMIT 1

        }
        $id = $this->request->getVar('id');
        session()->setFlashdata("Error", "");
        $usermodel->update($id, $data);
---
UPDATE `users` SET `name` = 'Dipti ', `lastname` = 'shelke', `phone` = '7249649901', `address` = 'Bhosari', `city` = 'Pune', `country` = 'India', `state` = 'Maharashtra', `pincode` = '39'
WHERE `users`.`id` IN ('8')